In [2]:
import pandas as pd

In [3]:
frame = pd.read_csv('dataset.tsv', sep='\t', header=0)

In [4]:
frame

      Name       Birth       City       Position
0   Иванов  22.03.1980     Москва            NaN
1  Сорокин  07.08.1965  Волгоград        Инженер
2    Белов  13.02.1980     Ростов       менеджер
3  Питюгов  16.01.1952     Москва  Дата-саентист
4    Мехно  02.10.1956     Якутск            NaN

# check to data types

In [5]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

# Apply  позволяет переводить данные из одного типа в другой
## f.e to_datetime - transform 'object' data type to 'date' type
## Работает не inplace

In [6]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [7]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [8]:
frame

      Name      Birth       City       Position
0   Иванов 1980-03-22     Москва            NaN
1  Сорокин 1965-07-08  Волгоград        Инженер
2    Белов 1980-02-13     Ростов       менеджер
3  Питюгов 1952-01-16     Москва  Дата-саентист
4    Мехно 1956-02-10     Якутск            NaN

# info - miniinfo about dataframe

In [9]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Birth     5 non-null      datetime64[ns]
 2   City      5 non-null      object
 3   Position  3 non-null      object
dtypes: datetime64[ns](1), object(3)
memory usage: 288.0+ bytes

# fillna - to insert data in NaN datatype

In [10]:
frame.fillna('', inplace= True)

In [11]:
frame

      Name      Birth       City       Position
0   Иванов 1980-03-22     Москва
1  Сорокин 1965-07-08  Волгоград        Инженер
2    Белов 1980-02-13     Ростов       менеджер
3  Питюгов 1952-01-16     Москва  Дата-саентист
4    Мехно 1956-02-10     Якутск

# To return column data write frame.{namecolumn}
## this method return column-vector objects

In [22]:
frame.Positionframe.drop('Elevation', axis=1, inplace = True)

0           Worker
1          Инженер
2         менеджер
3    Дата-саентист
4           Worker
Name: Position, dtype: object

# to return any column as table format write frame[['columnname']]

In [23]:
frame[['Position']]

        Position
0         Worker
1        Инженер
2       менеджер
3  Дата-саентист
4         Worker

# to return first rows use frame.head() or work with data as python list-type

In [28]:
frame.head()

      Name      Birth       City       Position
0   Иванов 1980-03-22     Москва         Worker
1  Сорокин 1965-07-08  Волгоград        Инженер
2    Белов 1980-02-13     Ростов       менеджер
3  Питюгов 1952-01-16     Москва  Дата-саентист

In [27]:
frame[2:3]

    Name      Birth    City  Position
2  Белов 1980-02-13  Ростов  менеджер

# to chose some rows or column use loc[[num, num], [name, name]] or iloc[[num, num], [num,num]]

In [30]:
frame.loc[[1,3,4], ['Name', 'City']]

      Name       City
1  Сорокин  Волгоград
3  Питюгов     Москва
4    Мехно     Якутск

In [31]:
frame.iloc[[1,3,4], [0, 1]]

      Name      Birth
1  Сорокин 1965-07-08
3  Питюгов 1952-01-16
4    Мехно 1956-02-10

# universal solution 'ix' doesn't work on Python3, NOTA BENE!

In [32]:
frame.ix[[1,3,4], ['Name', 'City']]

AttributeError: 'DataFrame' object has no attribute 'ix'

# to filter data use logical solutions

In [34]:
frame[frame.Birth >= pd.datetime(1950, 1, 1)]

/home/tater/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime instead.
  """Entry point for launching an IPython kernel.

      Name      Birth       City       Position
0   Иванов 1980-03-22     Москва         Worker
1  Сорокин 1965-07-08  Волгоград        Инженер
2    Белов 1980-02-13     Ростов       менеджер
3  Питюгов 1952-01-16     Москва  Дата-саентист
4    Мехно 1956-02-10     Якутск         Worker

In [35]:
frame[(frame.Birth >= pd.datetime(1950,1,1)) & (frame.City != 'Москва')]

/home/tater/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime instead.
  """Entry point for launching an IPython kernel.

      Name      Birth       City  Position
1  Сорокин 1965-07-08  Волгоград   Инженер
2    Белов 1980-02-13     Ростов  менеджер
4    Мехно 1956-02-10     Якутск    Worker